app/controllers/api/v1/interviews_controller.rb

SELECT "interviews".* FROM "interviews"
---
      def index
        @interviews = Interview.all

SELECT  "interviews".* FROM "interviews" WHERE "interviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      def show
        @interview = Interview.find(params[:id])

SELECT  "participants".* FROM "participants" WHERE "participants"."email" = ? LIMIT ?  [["email", "aswanth@gmail.com"], ["LIMIT", 1]]
INSERT INTO "participants" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "aswanth@gmail.com"], ["created_at", "2020-01-10 09:46:14.956965"], ["updated_at", "2020-01-10 09:46:14.956965"]]
INSERT INTO "interviews" ("date", "start", "end", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "participants".* FROM "participants" WHERE "participants"."email" = ?  [["email", "aswanth@gmail.com"]]
---
      def create
        @interview = Interview.new(interview_params)
        participantlist = params[:participantlist].to_s.split(",").map(&:to_s)
        puts params[:participantlist]
        puts participantlist
        peeps = []
        for p in participantlist
          par = Participant.find_by(:email => p)
          # puts par.email
          if not par
            par = Participant.new(:email => p)
            par.save
          end
          peeps << par
        end
        puts peeps
        if not Interview.time_overlap(peeps,@interview)
          @interview.save
          emails = []
          for p in peeps
            emails << p.email
            @interview.participants << p
          end
          t = @interview.start
          d = @interview.date
          c= Time.now
          current = DateTime.new(c.year,c.month,c.day,c.hour,c.min,c.sec).to_i
          start = DateTime.new(d.year,d.month,d.day,t.hour,t.min,t.sec).utc.to_i

SELECT  "interviews".* FROM "interviews" WHERE "interviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "participants".* FROM "participants" WHERE "participants"."email" = ? LIMIT ?  [["email", "aswanth@gmail.com"], ["LIMIT", 1]]
INSERT INTO "participants" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "aswanth@interviewbit.com"], ["created_at", "2020-01-11 10:22:45.732579"], ["updated_at", "2020-01-11 10:22:45.732579"]]
UPDATE "interviews" SET "date" = ?, "updated_at" = ? WHERE "interviews"."id" = ?  [["date", "2020-01-01"], ["updated_at", "2020-01-11 10:22:08.899757"], ["id", 10]]
---
      def update
        @interview = Interview.find(params[:id])
        currentInterview =Interview.new(interview_params)
        puts currentInterview.title
        currentInterview.id=params[:id]
        puts currentInterview.id
        participantlist = params[:participantlist].to_s.split(",").map(&:to_s)
        peeps = []
        for p in participantlist
          par = Participant.find_by(:email => p)
          # puts par.email
          if not par
            par = Participant.new(:email => p)
            par.save
          end
          peeps << par
        end
        puts peeps
        if not Interview.time_overlap(peeps,currentInterview)
          @interview.update_attributes(interview_params)

SELECT  "interviews".* FROM "interviews" WHERE "interviews"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "interviews" WHERE "interviews"."id" = ?  [["id", 9]]
---
      def destroy
        @interview = Interview.find(params[:id])

        if @interview.destroy