app/controllers/api/v1/participants_controller.rb

SELECT "participants".* FROM "participants"
---
      def index
        @participants = Participant.all