app/models/interview.rb

SELECT "interviews".* FROM "interviews" INNER JOIN "interviews_participants" ON "interviews"."id" = "interviews_participants"."interview_id" WHERE "interviews_participants"."participant_id" = ?  [["participant_id", 1]]
---
    def self.time_overlap(participants,currentInterview)
        puts "Proof that time overalap is running"
        puts currentInterview.title
        puts currentInterview.id
        puts participants[0].email
        for participant in participants
            puts "Participant name: "+ participant.email.to_s

			prevInterviews = participant.interviews
            prevInterviews.each do |interview|